Repository: 0x5bfa/moodle_native
Catalog: ios/MoodleNative/Localizable.xcstrings
Source language: ja
Languages: en

# timetable.title
source: 時間割
en: Timetable

# timetable.title.withSemester
source: 時間割 %@
en: Timetable %@

# timetable.toolbar.editCourses
source: 授業を編集
en: Edit courses

# timetable.toolbar.finishEditing
source: 編集を終了
en: Done editing

# timetable.unavailable.title
source: 時間割を表示できませんでした
en: Could not show timetable

# timetableConflict.coursePicker
source: 授業
en: Course

# timetableConflict.message
source: 同じ時間に複数の授業があります。時間割で使う授業を選んでください。
en: There are multiple courses at the same time. Choose which course to use in the timetable.

# timetableConflict.sectionTitle
source: %@曜%@限
en: %@ period %@

# timetableConflict.title
source: 重複授業
en: Course conflict

# timetableCourseEdit.accent.section
source: アクセントカラー
en: Accent color

# timetableCourseEdit.attendance.section
source: 出欠
en: Attendance

# timetableCourseEdit.favorite.add
source: Favorite に登録
en: Add to favorites

# timetableCourseEdit.favorite.remove
source: Favorite を解除
en: Remove from favorites

# timetableCourseEdit.favorite.unavailable.title
source: Favorite を更新できません
en: Could not update favorite

# timetableCourseEdit.memo.section
source: メモ
en: Memo

# timetableCourseEdit.title
source: 授業を編集
en: Edit course

# assignment.badge.overdue
source: 期限切れ
en: Overdue

# assignment.badge.upcoming
source: 課題あり
en: Assignment

# assignment.badge.undated
source: 期限未設定
en: No due date

# assignment.status.graded
source: 採点済み
en: Graded

# assignment.status.notMarked
source: 未採点
en: Not graded

# assignment.status.released
source: 成績公開済み
en: Released

# assignment.status.inMarking
source: 採点中
en: In marking

# assignment.status.notSubmitted
source: 未提出
en: Not submitted

# assignment.status.submitted
source: 提出済み
en: Submitted

# assignment.status.draft
source: 下書き
en: Draft

# assignment.status.reopened
source: 再提出
en: Resubmission

# assignment.plugin.details
source: 詳細
en: Details

# assignment.fileArea.submissionFiles
source: 提出ファイル
en: Submission files

# assignment.fileArea.intro
source: 概要資料
en: Intro materials

# assignment.fileArea.activity
source: 活動資料
en: Activity materials

# common.attachment
source: 添付ファイル
en: Attachment

# common.file
source: ファイル
en: File

# common.none
source: なし
en: None

# timetableStatus.favorite
source: お気に入り
en: Favorite

# timetableStatus.unreadAnnouncement
source: 未読アナウンスメント
en: Unread announcement

# timetableStatus.pendingAssignment
source: 未提出課題
en: Pending assignment

# timetableStatus.unreadForum
source: 未読フォーラム
en: Unread forum

# attendanceStatus.attended
source: 出席
en: Attended

# attendanceStatus.absent
source: 欠席
en: Absent

# attendanceStatus.late
source: 遅刻
en: Late

# attendanceStatus.canceled
source: 休講
en: Canceled

# lmsAuthentication.error.invalidLaunchURL
source: Moodle のログイン URL を組み立てられませんでした。
en: Could not build the Moodle login URL.

# lmsAuthentication.error.unableToStart
source: Moodle のログイン画面を開始できませんでした。
en: Could not start the Moodle login screen.

# lmsAuthentication.error.invalidStoredSession
source: 保存済みの Moodle セッションが壊れていたため読み込めませんでした。
en: The saved Moodle session could not be loaded because it was corrupted.

# lmsAuthentication.error.keychain
source: Moodle のログイン情報を Keychain に保存できませんでした。(status: %lld)
en: Could not save the Moodle login information to Keychain. (status: %lld)

# lmsAuthentication.error.loginFailed
source: Moodle のログインに失敗しました。
en: Could not sign in to Moodle.

# navigationPath.notifications
source: 通知タブ
en: Notifications tab

# navigationPath.assignments
source: 課題タブ
en: Assignments tab

# navigationPath.timetable
source: 時間割タブ
en: Timetable tab

# navigationPath.settings
source: 設定タブ
en: Settings tab

# navigationPath.settings.display
source: 設定 > 表示
en: Settings > Display

# navigationPath.settings.notificationPreferences
source: 設定タブ > moodle 通知設定
en: Settings tab > moodle notification settings

# navigationPath.settings.calendarPreferences
source: 設定タブ > Moodle カレンダー設定
en: Settings tab > Moodle calendar settings

# navigationPath.settings.messagePreferences
source: 設定タブ > Moodle メッセージ設定
en: Settings tab > Moodle message settings

# notifications.error.fetchFailed
source: 通知を取得できませんでした。
en: Could not fetch notifications.

# notificationPreferences.error.updateFailed
source: moodle 通知設定を更新できませんでした。
en: Could not update moodle notification settings.

# calendarPreferences.error.updateFailed
source: カレンダー設定を更新できませんでした。
en: Could not update calendar settings.

# messagePreferences.error.updateFailed
source: メッセージ設定を更新できませんでした。
en: Could not update message settings.

# settings.profile.error.fetchFailed
source: プロフィールを取得できませんでした。
en: Could not fetch the profile.

# assignments.error.fetchFailed
source: 課題一覧を取得できませんでした。
en: Could not fetch assignments.

# assignmentDetail.progress.saving
source: 提出ファイルを保存中...
en: Saving submission files...

# assignmentDetail.progress.submitting
source: 提出を確定中...
en: Submitting...

# assignmentDetail.progress.starting
source: 提出を開始中...
en: Starting submission...

# assignmentDetail.progress.removing
source: 提出を削除中...
en: Deleting submission...

# assignmentDetail.error.fetchFailed
source: 課題詳細を取得できませんでした。
en: Could not fetch assignment details.

# forumDiscussions.error.fetchFailed
source: フォーラム一覧を取得できませんでした。
en: Could not fetch forum discussions.

# forumDiscussionDetail.error.fetchFailed
source: 投稿内容を取得できませんでした。
en: Could not fetch the post content.

# weekday.monday.short
source: 月
en: Mon

# weekday.tuesday.short
source: 火
en: Tue

# weekday.wednesday.short
source: 水
en: Wed

# weekday.thursday.short
source: 木
en: Thu

# weekday.friday.short
source: 金
en: Fri

# weekday.saturday.short
source: 土
en: Sat

# weekday.sunday.short
source: 日
en: Sun

# timetable.error.loginRequired
source: Moodle にログインしてください。
en: Please sign in to Moodle.

# timetable.error.fetchFailed
source: 時間割データを取得できませんでした。
en: Could not fetch timetable data.

# courseDetail.error.fetchFailed
source: 授業内容を取得できませんでした。
en: Could not fetch course content.

# courseDetail.section.number
source: セクション %lld
en: Section %lld

# courseDetail.section.defaultTitle
source: 授業コンテンツ
en: Course content

# courseDetail.moduleType.assignment
source: 課題
en: Assignment

# courseDetail.moduleType.forum
source: フォーラム
en: Forum

# courseDetail.moduleType.resource
source: 資料
en: Resource

# courseDetail.moduleType.url
source: リンク
en: Link

# courseDetail.moduleType.page
source: ページ
en: Page

# courseDetail.moduleType.quiz
source: 小テスト
en: Quiz

# courseDetail.moduleType.attendance
source: 出欠管理
en: Attendance

# courseDetail.moduleType.folder
source: フォルダー
en: Folder

# courseDetail.moduleType.lti
source: LTI動画
en: LTI video

# timetableCourseEdit.favorite.error.updateFailed
source: Favorite の更新に失敗しました。
en: Could not update Favorite.

# timetableCourseEdit.attendance.incrementHint
source: タップで加算
en: Tap to increment

# debug.sampleCourse.title
source: ユーザビリティ工学
en: Usability Engineering

# debug.sampleCourse.shortName
source: ユーザビリティ工学(A1)
en: Usability Engineering (A1)

# debug.sampleCourse.summary
source: 授業の概要です。
en: This is the course summary.

# debug.sampleNotification.title
source: 新しいアナウンスメント
en: New announcement

# debug.sampleNotification.preview
source: 『ユーザビリティ工学』に新しい連絡があります。
en: There is a new notice for Usability Engineering.

# debug.sampleNotification.plainBody
source: 『ユーザビリティ工学』に新しい連絡があります。次回授業までに資料を確認してください。
en: There is a new notice for Usability Engineering. Please review the materials before the next class.

# debug.sampleNotification.fullMessage
source: 『ユーザビリティ工学』に新しい連絡があります。 次回授業までに資料を確認してください。
en: There is a new notice for Usability Engineering. Please review the materials before the next class.

# debug.sampleNotification.contextName
source: 授業ページ
en: Course page

# timetable.semester.spring.short
source: 春
en: Spr

# timetable.semester.fall.short
source: 秋
en: Fall

# timetable.semester.unknown.short
source: その他
en: Other

# timetable.semester.navigation.japaneseFormat
source: %lld年度 %@
en: %lld %@

# assignmentSubmission.submitting
source: 提出中...
en: Submitting...

# common.share
source: 共有
en: Share
